Documents/А_ФинРез_PL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ФинРез_PL</Name>
			<Comment>Документ свёртки PnL за месяц. ОбработкаПроведения портирует SQL из Reports/А_ОтчетPL/Ext/ObjectModule.bsl с добавлением колонки Source. Записывает в РегСв.А_ОтчетPL_Свод. Spec v3 §3.3.</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.А_ОтчетPL_Свод</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Первый день месяца за который свёртка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/А_ОтчетPL_Свод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ОтчетPL_Свод</Name>
			<Comment>Свёртка PnL за месяц (повторение паттерна Reports/А_ОтчетPL): 8 источников Source × Подразделение × СтатьяPL × Контрагент. Заполняется при проведении Документ.А_ФинРез_PL. Spec v3 §3.4.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаФ1_Excel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФ2_Excel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Excel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФ1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФ2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ИсточникPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_Статьи_PL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрочихАктивов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектУчетаРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/А_ИсточникPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_ИсточникPL</Name>
			<Comment>Маркер источника строки регистра А_ОтчетPL_Свод (8 значений: PL_Excel/4×ERP/2×Казна/2×Аномалии)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PL_Excel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_OpEx</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_CoGS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_Income</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_БезPL_Расх</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ERP_БезPL_Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна_PL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна_БезPL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/А_ФинРез_PL/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		Месяц = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// === Дублікат-захист: один документ на (Организация, Месяц, ВключатьДочерние) ===
	НачМесяца = НачалоМесяца(Месяц);
	КонМесяца = КонецМесяца(Месяц);

	ЗапросДубль = Новый Запрос;
	ЗапросДубль.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    ФР.Ссылка КАК Ссылка,
	|    ФР.Номер  КАК Номер,
	|    ФР.Дата   КАК Дата
	|ИЗ Документ.А_ФинРез_PL КАК ФР
	|ГДЕ
	|    ФР.Ссылка <> &ТекущийДок
	|    И НЕ ФР.ПометкаУдаления
	|    И ФР.Проведен
	|    И ФР.Организация = &Организация
	|    И ФР.Месяц МЕЖДУ &НачМесяца И &КонМесяца
	|    И ФР.ВключатьДочерние = &ВключатьДочерние";
	ЗапросДубль.УстановитьПараметр("ТекущийДок",       Ссылка);
	ЗапросДубль.УстановитьПараметр("Организация",      Организация);
	ЗапросДубль.УстановитьПараметр("НачМесяца",        НачМесяца);
	ЗапросДубль.УстановитьПараметр("КонМесяца",        КонМесяца);
	ЗапросДубль.УстановитьПараметр("ВключатьДочерние", ВключатьДочерние);
	РезДубль = ЗапросДубль.Выполнить();
	Если НЕ РезДубль.Пустой() Тогда
		ВыбДубль = РезДубль.Выбрать();
		ВыбДубль.Следующий();
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не можна провести: за %1 (Організація %2, ВключатиДочерні=%3) вже проведено документ %4 від %5. Перепроведіть існуючий або помітьте на видалення.",
				Формат(НачМесяца, "ДФ='ММММ yyyy'"),
				Организация,
				ВключатьДочерние,
				ВыбДубль.Номер,
				Формат(ВыбДубль.Дата, "ДФ='dd.MM.yyyy'")));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// === Свёртка PnL — 8 CTE + 7 UNION з Source ===
	Движения.А_ОтчетPL_Свод.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = СформироватьЗапросСверткиPL();
	Запрос.УстановитьПараметр("НачалоПериода",    НачМесяца);
	Запрос.УстановитьПараметр("КонецПериода",     КонМесяца);
	Запрос.УстановитьПараметр("ВключатьДочерние", ВключатьДочерние);
	Запрос.УстановитьПараметр("ДДСCoGS",          ПолучитьДДСПриёмникCoGS());
	Запрос.УстановитьПараметр("Организация",      Организация);

	Движения.А_ОтчетPL_Свод.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Аналог функції з Reports/А_ОтчетPL — повертає ДДС-приймач CoGS.
// Якщо немає — повертає ПустаяСсылка (тоді CoGS не з'являється у звіті).
Функция ПолучитьДДСПриёмникCoGS()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.СтатьиДвиженияДенежныхСредств
	|ГДЕ А_ПриёмникСебестоимостиПродажPL И НЕ ПометкаУдаления";
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	Возврат Рез[0].Ссылка;
КонецФункции

// Повертає верифікований SQL свёртки PnL з Source-маркером.
// Перевірений Python COM (Task 9): за лютий 2026 повертає 3945 рядків
// з 7-8 distinct Source значеннями, exact parity з Reports/А_ОтчетPL.
//
// Параметри: &НачалоПериода, &КонецПериода, &ВключатьДочерние, &ДДСCoGS, &Организация
Функция СформироватьЗапросСверткиPL()
	Возврат
	"// =====================================================================================
	|// VERIFIED SQL для А_ФинРез_PL.ОбработкаПроведения (Task 10).
	|//
	|// Дата перевірки: 2026-05-01
	|// Тест: _Rarzrabotki/Python/test/test_finrez_pl_query_2026-05-01.py
	|// База: BaseERP, період: лютий 2026 (2026-02-01 .. 2026-02-28).
	|//
	|// PARITY до копійки vs Reports/А_ОтчетPL.ПолучитьОбъединенныеДанные():
	|//   Rows = 3945  (точно як у Reports/А_ОтчетPL)
	|//   Σ СуммаПлан = 115,728,517.43 ₴
	|//   Σ СуммаЕРП  = 123,029,978.65 ₴
	|//   Σ СуммаКазна = -17,914,789.41 ₴ (нетто Приход − Расход)
	|//
	|// 7 з 8 значень Source присутні (ERP_БезPL_Расх = 0 рядків за лютий 2026 — це data state,
	|// а не баг запиту: за цей місяць усі расходы мають PL-зв'язок через ДДС).
	|//
	|// КЛЮЧОВА МОДИФІКАЦІЯ vs оригіналу Reports/А_ОтчетPL:
	|//   - втЕРП_ПоPL_Расх (старий, що містив OpEx + CoGS у UNION ALL) розділений на 2 секції
	|//     final UNION ALL:
	|//       секція 2 (Source=ERP_OpEx)  — JOIN втЕРП_Расх_Детали з втPL_ДДС
	|//       секція 3 (Source=ERP_CoGS)  — JOIN втЕРП_CoGS_Детали з втPL_ДДС
	|//   - кожна із 8 final-секцій додає літеральне значення Source через
	|//     ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.<значення>)
	|//
	|// СТРУКТУРА ВИХОДУ (18 колонок під РегистрСведений.А_ОтчетPL_Свод):
	|//   8 вимірювань: Организация, Подразделение, НаправлениеДеятельности, СтатьяPL,
	|//                 Группа, ДДС, Контрагент, Документ_Источник
	|//   5 атрибутів:  Source, СтатьяДоходов, СтатьяРасходов, ВалютаОригинала, Курс
	|//   5 ресурсів:   СуммаПланГрн, СуммаПланФ1Грн, СуммаПланФ2Грн, СуммаЕРПГрн, СуммаКазнаГрн
	|//
	|// ПАРАМЕТРИ ЗАПИТУ (для УстановитьПараметр):
	|//   &НачалоПериода   — НачалоМесяца(Месяц)
	|//   &КонецПериода    — КонецМесяца(Месяц)
	|//   &ВключатьДочерние — Boolean з шапки документа А_ФинРез_PL
	|//   &ДДСCoGS         — отримати через функцію аналогічну ПолучитьДДСПриёмникCoGS()
	|//                      (з Reports/А_ОтчетPL/Ext/ObjectModule.bsl рядки 55-74)
	|//   &Организация     — Организация з шапки документа А_ФинРез_PL
	|// =====================================================================================
	|
	|// ======================================================================
	|// PL-данные из документа (1 строка на PL-статью × Подразделение × Документ)
	|ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Документ,
	|	ТЧ.Ссылка.Подразделение КАК Подразделение,
	|	ТЧ.Ссылка.ПодразделениеСтрока КАК ПодразделениеСтрока,
	|	ТЧ.Статья КАК СтатьяPL,
	|	ТЧ.Статья.Группа КАК Группа,
	|	ТЧ.Статья.СтатьяДоходов КАК СтатьяДоходов,
	|	СУММА(ТЧ.СуммаФома1) КАК СуммаФ1,
	|	СУММА(ТЧ.СуммаФорма2) КАК СуммаФ2,
	|	СУММА(ТЧ.Сумма) КАК СуммаPL,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ТЧ.Комментарий КАК Строка(1000))) КАК Комментарий
	|ПОМЕСТИТЬ втPL
	|ИЗ Документ.А_ОтчетPL.ДанныеОтчета КАК ТЧ
	|ГДЕ ТЧ.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТЧ.Ссылка.ПометкаУдаления
	|	И ТЧ.Ссылка.ВключатьДочерние = &ВключатьДочерние
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Ссылка, ТЧ.Ссылка.Подразделение, ТЧ.Ссылка.ПодразделениеСтрока,
	|	ТЧ.Статья, ТЧ.Статья.Группа, ТЧ.Статья.СтатьяДоходов
	|;
	|
	|// ======================================================================
	|// Связь PL-статья → ДДС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатьиТЧ.Ссылка КАК СтатьяPL,
	|	СтатьиТЧ.СтатьяДвиженияДенежныхСредств КАК ДДС
	|ПОМЕСТИТЬ втPL_ДДС
	|ИЗ Справочник.А_Статьи_PL.Статьи КАК СтатьиТЧ
	|ГДЕ НЕ СтатьиТЧ.Ссылка.ПометкаУдаления
	|	И СтатьиТЧ.СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|;
	|
	|// ======================================================================
	|// ЕРП-расходы с детализацией до регистратора (как в АнализДоходовРасходов).
	|ВЫБРАТЬ
	|	Р.Подразделение КАК Подразделение,
	|	Р.СтатьяРасходов КАК СтатьяРасходов,
	|	Р.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств КАК ДДС,
	|	Р.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	СУММА(Р.СуммаПриход) КАК СуммаЕРП
	|ПОМЕСТИТЬ втЕРП_Расх_Детали
	|ИЗ РегистрНакопления.ПрочиеРасходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК Р
	|ГДЕ Р.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Р.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Р.Подразделение, Р.СтатьяРасходов, Р.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств, Р.Регистратор,
	|	ВЫБОР
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// ЕРП-доходы з деталізацією до регістратора + Контрагент.
	|ВЫБРАТЬ
	|	Д.Подразделение КАК Подразделение,
	|	Д.СтатьяДоходов КАК СтатьяДоходов,
	|	Д.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА Д.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	СУММА(Д.СуммаДох) КАК СуммаЕРП
	|ПОМЕСТИТЬ втЕРП_Доходы_Детали
	|ИЗ (
	|	ВЫБРАТЬ
	|		Выр.Подразделение КАК Подразделение,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ВыручкаОтПродаж) КАК СтатьяДоходов,
	|		Выр.ДокументДвижения КАК Регистратор,
	|		Выр.СуммаВыручки КАК СуммаДох
	|	ИЗ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выр
	|	ГДЕ Выр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Выр.Активность
	|		И Выр.СуммаВыручки <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ П.Подразделение, П.СтатьяДоходов, П.Регистратор, П.СуммаПриход
	|	ИЗ РегистрНакопления.ПрочиеДоходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК П
	|	ГДЕ П.СтатьяДоходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|) КАК Д
	|СГРУППИРОВАТЬ ПО Д.Подразделение, Д.СтатьяДоходов, Д.Регистратор,
	|	ВЫБОР
	|		КОГДА Д.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// ЕРП-CoGS: суми Себестоимости з ВыручкаИСебестоимостьПродаж
	|ВЫБРАТЬ
	|	Выр.Подразделение КАК Подразделение,
	|	&ДДСCoGS КАК ДДС,
	|	Выр.ДокументДвижения КАК Документ,
	|	ВЫБОР
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	СУММА(Выр.Стоимость) КАК СуммаЕРП
	|ПОМЕСТИТЬ втЕРП_CoGS_Детали
	|ИЗ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выр
	|ГДЕ Выр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выр.Активность
	|	И Выр.Стоимость <> 0
	|	И &ДДСCoGS <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО Выр.Подразделение, Выр.ДокументДвижения,
	|	ВЫБОР
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Выр.ДокументДвижения ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Выр.ДокументДвижения КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// КАСА: обороти регістра А_ДвиженияДенегИзКазны
	|ВЫБРАТЬ
	|	Каз.Подразделение                                                            КАК Подразделение,
	|	Каз.СтатьяДвиженияДенежныхСредств                                            КАК ДДС,
	|	Каз.ДокументДвиженияКазны                                                    КАК Документ,
	|	ВЫБОР
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ                                                                        КАК Контрагент,
	|	СУММА(ВЫБОР КОГДА Каз.СуммаОборот < 0 ТОГДА -Каз.СуммаОборот ИНАЧЕ 0 КОНЕЦ)  КАК СуммаКазнаРасход,
	|	СУММА(ВЫБОР КОГДА Каз.СуммаОборот > 0 ТОГДА  Каз.СуммаОборот ИНАЧЕ 0 КОНЕЦ)  КАК СуммаКазнаПриход
	|ПОМЕСТИТЬ втКазна_ПоПодрДДС
	|ИЗ РегистрНакопления.А_ДвиженияДенегИзКазны.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Каз
	|ГДЕ Каз.СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО Каз.Подразделение, Каз.СтатьяДвиженияДенежныхСредств, Каз.ДокументДвиженияКазны,
	|	ВЫБОР
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// 1) PL_Excel — строки PL для регистра.
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	PL.Подразделение КАК Подразделение,
	|	PL.Подразделение.А_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	PL.СтатьяPL КАК СтатьяPL,
	|	PL.Группа КАК Группа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) КАК ДДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	PL.Документ КАК Документ_Источник,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.PL_Excel) КАК Source,
	|	PL.СтатьяДоходов КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаОригинала,
	|	1 КАК Курс,
	|	PL.СуммаPL КАК СуммаПланГрн,
	|	PL.СуммаФ1 КАК СуммаПланФ1Грн,
	|	PL.СуммаФ2 КАК СуммаПланФ2Грн,
	|	0 КАК СуммаЕРПГрн,
	|	0 КАК СуммаКазнаГрн
	|ПОМЕСТИТЬ втРезультат
	|ИЗ втPL КАК PL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 2) ERP_OpEx — расходы привязанные к PL через ДДС (БЕЗ CoGS).
	|ВЫБРАТЬ
	|	&Организация,
	|	ЕРПР.Подразделение,
	|	ЕРПР.Подразделение.А_НаправлениеДеятельности,
	|	PLДДС.СтатьяPL,
	|	PLДДС.СтатьяPL.Группа,
	|	ЕРПР.ДДС,
	|	ЕРПР.Контрагент,
	|	ЕРПР.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.ERP_OpEx),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка),
	|	ЕРПР.СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	ЕРПР.СуммаЕРП,
	|	0
	|ИЗ втЕРП_Расх_Детали КАК ЕРПР
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС ПО PLДДС.ДДС = ЕРПР.ДДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 3) ERP_CoGS — себестоимость продаж привязанная к спецДДС.
	|ВЫБРАТЬ
	|	&Организация,
	|	ЕРПР.Подразделение,
	|	ЕРПР.Подразделение.А_НаправлениеДеятельности,
	|	PLДДС.СтатьяPL,
	|	PLДДС.СтатьяPL.Группа,
	|	ЕРПР.ДДС,
	|	ЕРПР.Контрагент,
	|	ЕРПР.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.ERP_CoGS),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	ЕРПР.СуммаЕРП,
	|	0
	|ИЗ втЕРП_CoGS_Детали КАК ЕРПР
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС ПО PLДДС.ДДС = ЕРПР.ДДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 4) ERP_Income — доходы привязанные к PL через СтатьяДоходов.
	|ВЫБРАТЬ
	|	&Организация,
	|	ЕРПД.Подразделение,
	|	ЕРПД.Подразделение.А_НаправлениеДеятельности,
	|	PL.Ссылка,
	|	PL.Группа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ЕРПД.Контрагент,
	|	ЕРПД.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.ERP_Income),
	|	ЕРПД.СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	СУММА(ЕРПД.СуммаЕРП),
	|	0
	|ИЗ втЕРП_Доходы_Детали КАК ЕРПД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.А_Статьи_PL КАК PL
	|		ПО PL.СтатьяДоходов = ЕРПД.СтатьяДоходов
	|ГДЕ НЕ PL.ПометкаУдаления И НЕ PL.ЭтоГруппа
	|СГРУППИРОВАТЬ ПО
	|	ЕРПД.Подразделение, ЕРПД.Подразделение.А_НаправлениеДеятельности,
	|	PL.Ссылка, PL.Группа, ЕРПД.СтатьяДоходов, ЕРПД.Документ, ЕРПД.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 5) ERP_БезPL_Расх — расходы без связи с PL.
	|ВЫБРАТЬ
	|	&Организация,
	|	ЕРПР.Подразделение,
	|	ЕРПР.Подразделение.А_НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.А_Статьи_PL.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.А_ГруппаСтатей_PL.ПустаяСсылка),
	|	ЕРПР.ДДС,
	|	ЕРПР.Контрагент,
	|	ЕРПР.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.ERP_БезPL_Расх),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка),
	|	ЕРПР.СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	ЕРПР.СуммаЕРП,
	|	0
	|ИЗ втЕРП_Расх_Детали КАК ЕРПР
	|ГДЕ НЕ ЕРПР.ДДС В (ВЫБРАТЬ PLД.ДДС ИЗ втPL_ДДС КАК PLД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 6) ERP_БезPL_Доход — доходы без связи с PL.
	|ВЫБРАТЬ
	|	&Организация,
	|	ЕРПД.Подразделение,
	|	ЕРПД.Подразделение.А_НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.А_Статьи_PL.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.А_ГруппаСтатей_PL.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка),
	|	ЕРПД.Контрагент,
	|	ЕРПД.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.ERP_БезPL_Доход),
	|	ЕРПД.СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	ЕРПД.СуммаЕРП,
	|	0
	|ИЗ втЕРП_Доходы_Детали КАК ЕРПД
	|ГДЕ НЕ ЕРПД.СтатьяДоходов В
	|	(ВЫБРАТЬ PL.СтатьяДоходов ИЗ Справочник.А_Статьи_PL КАК PL
	|	 ГДЕ PL.СтатьяДоходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|		И НЕ PL.ПометкаУдаления И НЕ PL.ЭтоГруппа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 7) Казна_PL — Каса привязанная к PL через ДДС.
	|ВЫБРАТЬ
	|	&Организация,
	|	К.Подразделение,
	|	К.Подразделение.А_НаправлениеДеятельности,
	|	PLДДС.СтатьяPL,
	|	PLДДС.СтатьяPL.Группа,
	|	К.ДДС,
	|	К.Контрагент,
	|	К.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.Казна_PL),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	0,
	|	К.СуммаКазнаПриход - К.СуммаКазнаРасход
	|ИЗ втКазна_ПоПодрДДС КАК К
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС ПО PLДДС.ДДС = К.ДДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// 8) Казна_БезPL — Каса без связи с PL.
	|ВЫБРАТЬ
	|	&Организация,
	|	К.Подразделение,
	|	К.Подразделение.А_НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.А_Статьи_PL.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.А_ГруппаСтатей_PL.ПустаяСсылка),
	|	К.ДДС,
	|	К.Контрагент,
	|	К.Документ,
	|	ЗНАЧЕНИЕ(Перечисление.А_ИсточникPL.Казна_БезPL),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	1,
	|	0,
	|	0,
	|	0,
	|	0,
	|	К.СуммаКазнаПриход - К.СуммаКазнаРасход
	|ИЗ втКазна_ПоПодрДДС КАК К
	|ГДЕ НЕ К.ДДС В (ВЫБРАТЬ PLД.ДДС ИЗ втPL_ДДС КАК PLД)
	|;
	|
	|// ======================================================================
	|// Финальный SELECT — данные для регистра А_ОтчетPL_Свод (загрузить через Движения.А_ОтчетPL_Свод.Загрузить()).
	|ВЫБРАТЬ
	|	Организация,
	|	Подразделение,
	|	НаправлениеДеятельности,
	|	СтатьяPL,
	|	Группа,
	|	ДДС,
	|	Контрагент,
	|	Документ_Источник,
	|	Source,
	|	СтатьяДоходов,
	|	СтатьяРасходов,
	|	ВалютаОригинала,
	|	Курс,
	|	СуммаПланГрн,
	|	СуммаПланФ1Грн,
	|	СуммаПланФ2Грн,
	|	СуммаЕРПГрн,
	|	СуммаКазнаГрн
	|ИЗ втРезультат";
КонецФункции

#КонецОбласти

#КонецЕсли
